kylemanna/kinetis-sdk2/boards/twrk21f120m/demo_apps/emvl1/emvl1.c
/*
 * Copyright (c) 2015 - 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_device_registers.h"
#include "fsl_debug_console.h"
#include "board.h"
#include "emvl1_core.h"
#include "emvl1_adapter_sdk.h"

#if defined(FSL_FEATURE_SOC_EMVSIM_COUNT) && FSL_FEATURE_SOC_EMVSIM_COUNT
#include "fsl_smartcard_emvsim.h"
#else
#include "fsl_smartcard_uart.h"
#endif
#if USING_PHY_TDA8035
#include "fsl_smartcard_phy_tda8035.h"
#endif
#if USING_PHY_EMVSIM
#include "fsl_smartcard_phy_emvsim.h"
#endif

#include "pin_mux.h"
#include "fsl_port.h"
#include <stdbool.h>
#include "clock_config.h"
/*******************************************************************************
* Definitions
******************************************************************************/

#define CORE_CLK_FREQ CLOCK_GetFreq(kCLOCK_CoreSysClk)
#define EMVL1_ATR_BUFF_SIZE (100u)
#define MAX_AFL (16u)
#define AID_ENTRIES (7u)
#define DESIRED_CARD_INFO_TAGS (3u)
#define CARDHOLDER_NAME_LEN (64u)
#define APP_EXP_DATE_LEN (64u)
#define PRIMARY_ACCOUNT_NUMBER_LEN (64u)
/*! @brief Defines of smartcard payment types. */
typedef enum
{
    kCardMastercard = 0x00,
    kCardVisa,
    kCardVisaElectron,
    kCardAmex,
    kCardEuropay,
    kCardUnionPayDebit,
    kCardUnionPayCredit,
    kCardUnsupported = 0xFF,
} card_type_t;
/*******************************************************************************
* Prototypes
******************************************************************************/
static void wait_for_card_presence(smartcard_context_t *context);
static bool smartcard_emvl1_t0_test(smartcard_core_params_t *coreParams);
static bool smartcard_emvl1_t1_test(smartcard_core_params_t *coreParams);
static int8_t smartcard_tc_check_testresult(smartcard_core_params_t *coreParams);
static void smartcard_init_user_config(smartcard_context_t *context);
void installTimeDelay(smartcard_context_t *context);
void timeDelay(uint32_t miliseconds);
void smartcard_interrupts_config(void);
int extract_afl_list(uint8_t list[MAX_AFL][4], uint8_t *src);
smartcard_core_error_t send_command(smartcard_core_params_t *coreParams,
                                    uint8_t p1,
                                    uint8_t p2,
                                    smartcard_tal_cmd_t *cmd,
                                    smartcard_tal_resp_t *resp,
                                    card_type_t type);

/*******************************************************************************
 * Variables
 ******************************************************************************/
#if defined(FSL_FEATURE_SOC_EMVSIM_COUNT) && FSL_FEATURE_SOC_EMVSIM_COUNT
static EMVSIM_Type *base = BOARD_SMARTCARD_MODULE;
#else
static UART_Type *base = BOARD_SMARTCARD_MODULE;
#endif

smartcard_context_t *g_smartcardContext;
uint8_t txBuff[EMVL1_MAX_TRANSFER_SIZE] = {0u};
uint8_t rxBuff[EMVL1_MAX_TRANSFER_SIZE] = {0u};
uint8_t prim_account_num[PRIMARY_ACCOUNT_NUMBER_LEN] = {0u};
uint8_t expir_date[APP_EXP_DATE_LEN] = {0u};
uint8_t card_holder[CARDHOLDER_NAME_LEN] = {0u};
uint8_t *card_items[DESIRED_CARD_INFO_TAGS] = {&prim_account_num[0], &expir_date[0], &card_holder[0]};
bool cardItem_found[DESIRED_CARD_INFO_TAGS];

/*! @brief EMV Application Identifiers */
const uint8_t g_emvMastercardAid[] = {0xA0, 0x00, 0x00, 0x00, 0x04, 0x10, 0x10};
const uint8_t g_emvVisaAid[] = {0xA0, 0x00, 0x00, 0x00, 0x03, 0x10, 0x10};
const uint8_t g_emvVisaElectronAid[] = {0xA0, 0x00, 0x00, 0x00, 0x03, 0x20, 0x10};
const uint8_t g_emvAmexAid[] = {0xA0, 0x00, 0x00, 0x00, 0x25, 0x01};
const uint8_t g_emvEuropayAid[] = {0xA0, 0x00, 0x00, 0x00, 0x10, 0x10, 0x30};
const uint8_t g_emvUnionPayDebitAid[] = {0xA0, 0x00, 0x00, 0x03, 0x33, 0x01, 0x01, 0x01};
const uint8_t g_emvUnionPayCreditAid[] = {0xA0, 0x00, 0x00, 0x03, 0x33, 0x01, 0x01, 0x02};

const uint32_t g_aidTable[AID_ENTRIES][2] = {
    {(uint32_t)&g_emvMastercardAid, sizeof(g_emvMastercardAid)},
    {(uint32_t)&g_emvVisaAid, sizeof(g_emvVisaAid)},
    {(uint32_t)&g_emvVisaElectronAid, sizeof(g_emvVisaElectronAid)},
    {(uint32_t)&g_emvAmexAid, sizeof(g_emvAmexAid)},
    {(uint32_t)&g_emvEuropayAid, sizeof(g_emvEuropayAid)},
    {(uint32_t)&g_emvUnionPayDebitAid, sizeof(g_emvUnionPayDebitAid)},
    {(uint32_t)&g_emvUnionPayCreditAid, sizeof(g_emvUnionPayCreditAid)},
};

/*! @brief EMV(book 3) Data elements */
const uint8_t g_desiredTags[DESIRED_CARD_INFO_TAGS][2] = {
    {0x5A, 0x00}, /*!< Application Primary account number (PAN) */
    {0x5F, 0x24}, /*!< Application expiration date */
    {0x5F, 0x20}, /*!< Cardholder name */
};
