kylemanna/kinetis-sdk2/boards/twrk21f120m/demo_apps/emvl1/emvl1.c
/*******************************************************************************
* Code
******************************************************************************/

/* IRQ handler for uart */
void UART0_RX_TX_IRQHandler(void)
{
    SMARTCARD_UART_IRQHandler(BOARD_SMARTCARD_MODULE, g_smartcardContext);
}
/* Error IRQ handler for uart */
void UART0_ERR_IRQHandler(void)
{
    SMARTCARD_UART_ErrIRQHandler(BOARD_SMARTCARD_MODULE, g_smartcardContext);
}
/* Pit timer channel 0 IRQ handler */
void PIT0_IRQHandler(void)
{
    SMARTCARD_UART_TSExpiryCallback(BOARD_SMARTCARD_MODULE, g_smartcardContext);
}
/* IRQ handler for card presence detection */
void PORTD_IRQHandler(void)
{
    /* Clear interrupt status flags */
    PORT_ClearPinsInterruptFlags(PORTD, 1u << 14u);
    SMARTCARD_PHY_TDA8035_IRQHandler(BOARD_SMARTCARD_MODULE, g_smartcardContext);
}
/*!
 * @brief Time delay required by smartcard test and smartcard driver. Function
 * waits desired time.
 */
void timeDelay(uint32_t microseconds)
{
    microseconds++;
    /* Wait desired time */
    while (microseconds > 0)
    {
        if (SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk)
        {
            microseconds--;
        }
    }
}

/*!
 * @brief Function initializes time delay for smartcard driver
 */
void installTimeDelay(smartcard_context_t *context)
{
    /* Disable SysTick timer */
    SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
    /* Initialize Reload value to 1us */
    SysTick->LOAD = CORE_CLK_FREQ / 1000000;
    /* Set clock source to processor clock */
    SysTick->CTRL |= SysTick_CTRL_CLKSOURCE_Msk;
    /* Enable SysTick timer */
    SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk;
    /* Store time delay function to smartcard context */
    context->timeDelay = timeDelay;
}

/*!
 * @brief Function initializes time delay for smartcard driver
 */
void smartcard_interrupts_config(void)
{
    /* Set smartcard communication peripheral interrupt priority */
    NVIC_SetPriority(BOARD_SMARTCARD_MODULE_IRQ, 8u);
#if defined(BOARD_SMARTCARD_MODULE_ERRIRQ)
    NVIC_SetPriority(BOARD_SMARTCARD_MODULE_ERRIRQ, 6u);
#endif
/* Set smartcard presence detect gpio pin interrupt priority */
#if defined(USING_PHY_TDA8035)
    NVIC_SetPriority(BOARD_SMARTCARD_IRQ_PIN_IRQ, 6u);
#endif /* USING_TDA8035_INTERFACE */
       /* Set external PIT timer interrupt priority
        * (used for initial TS char detection time-out) */
#if !(defined(FSL_FEATURE_SOC_EMVSIM_COUNT) && (FSL_FEATURE_SOC_EMVSIM_COUNT))
#if !defined(BOARD_SMARTCARD_TS_TIMER_IRQ)
#error "Please specify external PIT timer interrupt !"
#else
    NVIC_SetPriority(BOARD_SMARTCARD_TS_TIMER_IRQ, 6u);
#endif
#endif
}

/*!
 * @brief This function initialize smartcard_user_config_t structure. Enables configuration
 * of most common settings of the UART peripheral, smartcard clock, smartcard interface configuration,
 * interface instance number, slot number, operating voltage ...
 */
void smartcard_init_user_config(smartcard_context_t *context)
{
    /* Initialize interface configuration structure to default values */
    SMARTCARD_PHY_GET_DEFAULT_CONFIG(&context->interfaceConfig);
    context->interfaceConfig.smartCardClock = BOARD_SMARTCARD_CLOCK_VALUE;
    context->interfaceConfig.vcc = kSMARTCARD_VoltageClassB3_3V;
    context->interfaceConfig.clockModule = BOARD_SMARTCARD_CLOCK_MODULE;
    context->interfaceConfig.clockModuleChannel = BOARD_SMARTCARD_CLOCK_MODULE_CHANNEL;
    context->interfaceConfig.clockModuleSourceClock = BOARD_SMARTCARD_CLOCK_MODULE_SOURCE_CLK;
    context->interfaceConfig.controlPort = BOARD_SMARTCARD_CONTROL_PORT;
    context->interfaceConfig.controlPin = BOARD_SMARTCARD_CONTROL_PIN;
#if defined(BOARD_SMARTCARD_IRQ_PORT)
    context->interfaceConfig.irqPort = BOARD_SMARTCARD_IRQ_PORT;
    context->interfaceConfig.irqPin = BOARD_SMARTCARD_IRQ_PIN;
#endif
    context->interfaceConfig.resetPort = BOARD_SMARTCARD_RST_PORT;
    context->interfaceConfig.resetPin = BOARD_SMARTCARD_RST_PIN;
#if defined(USING_PHY_TDA8035)
    context->interfaceConfig.vsel0Port = BOARD_SMARTCARD_VSEL0_PORT;
    context->interfaceConfig.vsel0Pin = BOARD_SMARTCARD_VSEL0_PIN;
    context->interfaceConfig.vsel1Port = BOARD_SMARTCARD_VSEL1_PORT;
    context->interfaceConfig.vsel1Pin = BOARD_SMARTCARD_VSEL1_PIN;
#endif
#if defined(BOARD_SMARTCARD_TS_TIMER_ID)
    context->interfaceConfig.tsTimerId = BOARD_SMARTCARD_TS_TIMER_ID;
#endif
}

/*!
 * @brief Callback function for the Smartcard interface/PHY IC ISR
 */
void smartcard_interface_callback_function(void *base, void *g_smartcardState)
{
    /* Smartcard insertion/removal event occur */
    /* Put your code here */
}

/*!
 * @brief This function waits for card insertion/detection
 */
void wait_for_card_presence(smartcard_context_t *context)
{
    smartcard_interface_control_t interfaceControl = kSMARTCARD_InterfaceReadStatus;

    /* Putting delay as few boards has de-bouncing cap in card slot presence detect pin */
    timeDelay(1000 * 1000);
    /* clear present flag */
    context->cardParams.present = 0;
    /* Read card presence status */
    SMARTCARD_PHY_CONTROL(context, interfaceControl, 0);
    /* Check if a card is already inserted */
    if (!context->cardParams.present)
    {
        PRINTF("Please insert a smart card to test\r\n");
    }
    /* Wait until card is present */
    while (true)
    {
        /* Read card presence status */
        SMARTCARD_PHY_CONTROL(context, interfaceControl, 0);
        /* Return if card is present/inserted */
        if (context->cardParams.present)
        {
            break;
        }
    }
}

/*!
 * @brief Function search for appropriate card AID from hard-coded table.
 */
card_type_t scan_aid(smartcard_core_params_t *coreParams, smartcard_tal_cmd_t *cmd, smartcard_tal_resp_t *resp)
{
    smartcard_core_error_t status;
    uint32_t i;

    for (i = 0; i < AID_ENTRIES; i++)
    {
        txBuff[0] = 0x00u;
        txBuff[1] = 0xA4u;
        txBuff[2] = 0x04u;
        txBuff[3] = 0x00u;
        txBuff[4] = g_aidTable[i][1];

        memcpy(&txBuff[5u], (uint8_t *)g_aidTable[i][0u], g_aidTable[i][1u]);
        txBuff[5u + g_aidTable[i][1u]] = 0x00u;
        cmd->length = 5u + g_aidTable[i][1u] + 1u;

        status = smartcard_tal_send_cmd(coreParams, cmd, resp);

