kylemanna/kinetis-sdk2/boards/twrk21f120m/demo_apps/emvl1/emvl1.c
    /* payload length */
    if (talResp.length != (length + 2))
    {
        return false;
    }

    for (i = 0u; i < length; i++)
    {
        if ((txBuff[i + 5u] + increment) != rxBuff[i])
        {
            PRINTF("Echo test Failed.\r\n");
            return false;
        }
    }
    PRINTF("Echo data matched!\r\n");

    return (kSCCoreSuccess == smartcard_tc_check_testresult(coreParams));
}

/*!
 * @brief This test will use EMV Level 1 APIs from emvlib and do protocol tests for T=0 using a
 * smartcard credit cards.
 */
void smartcard_emvl1_test(uint32_t param)
{
    uint8_t atrBuff[EMVL1_ATR_BUFF_SIZE];
    uint32_t atrLength = 0u;
    smartcard_core_params_t coreParams;
    smartcard_context_t context = {0};
    g_smartcardContext = &context;
    bool testT0done = false;
    bool testT1done = false;
    bool testPassed = false;

    memset(&coreParams, 0u, sizeof(smartcard_core_params_t));
    memset(&context, 0u, sizeof(smartcard_context_t));
    /* initialize EMV Level 1 core library */

    /* app must set EMVL1 in structure smartcard_core_params_t to 1 for emvl1, or 0 for 7816 */
    coreParams.EMVL1 = 1;

    coreParams.x_context = &context;
    /* Initialize smartcard interrupts */
    smartcard_interrupts_config();
    /* Install time delay defined in application to smartcard driver. */
    installTimeDelay(&context);
    /* Fill-in smartcard config structure with init data */
    smartcard_init_user_config(&context);
    /* Print welcome string */
    PRINTF("........................... EMVL1 demo ..............................\r\n");
    /* Initialize the smartcard module with base address and configuration structure */
    SMARTCARD_INIT(base, &context, BOARD_SMARTCARD_CLOCK_MODULE_CLK_FREQ);
    SMARTCARD_PHY_INIT(base, &context.interfaceConfig, BOARD_SMARTCARD_CLOCK_MODULE_CLK_FREQ);
    /* Install test/application callback function */
    context.interfaceCallback = smartcard_interface_callback_function;
    /* Wait for a card inserted */
    wait_for_card_presence(&context);
    PRINTF("Card inserted.\r\n");
    /* Deactivate the card */
    PRINTF("Deactivating card...");
    SMARTCARD_PHY_DEACTIVATE(&context);
    PRINTF("Done!\r\n");

    do
    {
        /* Invalidate ATR buffer first */
        memset(atrBuff, 0, EMVL1_ATR_BUFF_SIZE);
        /* Deactivate the card */
        PRINTF("Resetting/Activating card...");
        /* get ATR */
        atrLength = 0u;
        if (smartcard_reset_handle_atr(&coreParams, atrBuff, kSMARTCARD_ColdReset, kSMARTCARD_NoWarmReset,
                                       &atrLength) == kSCCoreFail)
        {
            PRINTF("Invalid ATR received!\r\n");
            break;
        }
        PRINTF("Done!\r\n");
        if (context.cardParams.t0Indicated && !testT0done)
        { /* Invoke T=0 protocol specific test */
            testPassed = smartcard_emvl1_t0_test(&coreParams);
            testT0done = true;
            if (!testPassed)
            {
                PRINTF("Unsupported card inserted.\r\n");
                PRINTF("Received status bytes: 0x%.2X, 0x%.2X \r\n", context.statusBytes[0u], context.statusBytes[1u]);
            }
        }
        else if (context.cardParams.t1Indicated && !testT1done)
        { /* Invoke T=1 protocol specific test */
            testPassed = smartcard_emvl1_t1_test(&coreParams);
            testT1done = true;
            if (!testPassed)
            {
                PRINTF("Unsupported card inserted.\r\n");
            }
        }
        /* Deactivate the card */
        PRINTF("Deactivating card...");
        SMARTCARD_PHY_DEACTIVATE(coreParams.x_context);
        PRINTF("Done!\r\n");
        if (testT1done || !context.cardParams.t1Indicated)
        {
            break;
        }
    } while (1);
    /* De-initialize smartcard driver */
    SMARTCARD_PHY_DEINIT(base, &context.interfaceConfig);
    SMARTCARD_DEINIT(base);

    PRINTF("***** EMVL1 Demo End *****\r\n\r\n");
}

int main(void)
{
    /* Initialize board hardware */
    BOARD_InitPins();

    /* Initialize pin interrupt */
    PORT_SetPinInterruptConfig(PORTD, 14u, kPORT_InterruptEitherEdge);

    BOARD_BootClockRUN();
    BOARD_InitDebugConsole();
    /* Run emvl1 functionality check */
    smartcard_emvl1_test(0u);

    while (1)
    {
    }
}
